Tekla Open API Reference for Tekla Structures 2025
TaskDependency.Local Property
 The locality indicates if the dependency was created in Tekla Structures and Task Manager or imported.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool Local { get; set; }
Public Property Local As Boolean
	Get
	Set
Property Value
Type: Boolean
See Also
Reference
TaskDependency Class
Tekla.Structures.Model Namespace